SQL - Standard Querry Language

Run any Language, we needed an IDE
https://sqliteonline.com/

1. Query a database
- can manipulate data within a database
- create, or retrieve data from a database

2. CRUD operations on Records
- Create
- Read
- Update
- Delete

Run SQL in a python based version, called SQLite

SELECT - extract data from a database
- insert

/*
-- Create Department table -----------------------
CREATE TABLE Department (
    id INT PRIMARY KEY,
    name VARCHAR(50)
);

-- Create Employees table ------------------------
CREATE TABLE Employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    department_id INT,
    salary INT,
    city VARCHAR(50),
    hiring_year INT,
    FOREIGN KEY (department_id) REFERENCES Department(id)
);
*/

-- View Department table --------------------------
SELECT * FROM Department;

-- Insert data into Department --------------------
INSERT INTO Department (id, name)
VALUES
    (1, 'Art'),
    (2, 'Religion'),
    (3, 'Science');

-- View Employees table ---------------------------
SELECT * FROM Employees;

-- Insert data into Employees ---------------------
INSERT INTO Employees (id, name, department_id, salary, city, hiring_year)
VALUES
    (1, 'Aafiyah', 1, 2500, 'Sepang', 2021),
    (2, 'Rania',   2, 2000, 'KL',     2009),
    (3, 'Aydan',   3, 4000, 'KL',     2017);

-- Query employees by city -------------------------
SELECT name, salary, city, hiring_year
FROM Employees
WHERE city IN ('New York', 'Chicago');

-- To filter result table --------------------------
SELECT name, salary, city, hiring_year
FROM Employees
WHERE salary BETWEEN 2000 AND 5000
ORDER BY hiring_year DESC;

-- To add a column table but the column is not saved -----------

SELECT name, salary, salary * 12 AS yearly_salary
FROM employees;


-- To sort the order --------------------------------
SELECT * FROM Employees

SELECT name, salary
FROM employees
ORDER BY salary ASC;

EXERCISE
-------------------------------------------------------------

1. Write a SQL statement to create the employees table with the columns:

emp_id (integer, primary key)

name (text, not null)

department (text, not null)

salary (integer)

city (text)

2. Write INSERT statements to add at least 5 employees into the employees table with different departments, salaries, and cities.

3. Write a query to show all columns for all employees in the table.

4. Write a query to show only the name and salary of all employees.

5. Write a query to show all employees who work in the Engineering department.

6. Write a query to show all employees whose salary is greater than 50,000.

7. Write a query to show all employees who live in the city Mumbai.

8. Write a query to list all employees ordered by salary from highest to lowest.

9. Write a query to list all employees ordered by name in Aâ€“Z order.

10. Write a query to show the name, salary, and a calculated column called monthly_salary which is salary / 12.

11. Write an ALTER TABLE statement to add a new column called monthly_salary to the employees table.

12. Write an UPDATE statement to fill the monthly_salary column for all employees so that monthly_salary = salary / 12.

13. Add another calculated column, salary_next_year, such that the current salary has been increased by 9%.

Salary + 0.09 * Salary = salary_next_year